<?php

require_once('../ahov.inc');

$wind = ($_POST['wind'] == "")? 1 : $_POST['wind'];

if($wind > 4) $_POST['stability'] = 'isotherm';
if($wind < 1) $wind = 1;
if($wind > 15) $wind = 15;

if(isset($_POST['max'])) { $_POST['time'] = 9999; }

$temp = ($_POST['temp'] == "")? 20 : $_POST['temp'];

print '<h2>Расчет коэффициентов К6 для каждого АХОВ</h2>';

$k4 = k4($wind);

$k5 = k5($_POST['stability']);

$h = ($_POST['height'] == "")? 0.05 : $_POST['height'] - 0.2;

for($i = 0; $i < $_POST['number']; $i++) {

    $a[$i] = ahov($ahov, $_POST['ded'.$i], 'compressed');

    $k7[$i] = k7($a[$i], $k1[$i], $temp);

    //-----------------------------------------------------

    $t[$i] = round($_POST['height'] * $a[$i]['density']['liquid'] / ($a[$i]['K2'] * $k4 * $k7[$i][2]), 2);

    print 'Tисп'.$i.' = h * pж / (K2 * K4 * K7в) =
          '.$_POST['height'].' * '.$a[$i]['density']['liquid'].' / ( '.$a[$i]['K2'].' * '.$k4.' * '.$k7[$i][2].' ) =
          <em>'.$t[$i].' [ч]</em>';

    print '<br/><br/>';
    

    if($t[$i] < 1) {

        $k6[$i] = 1;

    } else {

        if(isset($_POST['max'])) $_POST['time'] = 9999; # -> inf

        $k6[$i] = round(pow(min($t[$i], $_POST['time']), 0.8), 2);

        print 'K6'.$i.' = min(Tисп, Тпрог)^0.8 =
              min('.$t[$i].', '.$_POST['time'].')^0.8 =
              <em>'.$k6[$i].'</em>';

        print '<br/><br/>';
    }
}

//---------------------------------------------------ME-----------------------------------------------------------------------

print '<h2>Расчет эквивалентного количества АХОВ</h2>';

$me = 0;

print 'Mэ = 20 * K4 * K5 * S{ K2 * K3 * K6 * K7в * M0 / pж }i =
       20 * '.$k4.' * '.$k5.' * (';

for($i = 0; $i < $_POST['number']; $i++) {

    $me += $a[$i]['K2'] * $a[$i]['K3'] * $k6[$i] * $k7[$i][2] * $_POST['weight'.$i] / $a[$i]['density']['liquid'];

    print $a[$i]['K2'].' * '.$a[$i]['K3'].' * '.$k6[$i].' * '.$k7[$i][2].' * '.$_POST['weight'.$i].' / '.$a[$i]['density']['liquid'];

    if($i == $_POST['number'] - 1) print ') = '; else print ' + ';
}

$me = round(20 * $k4 * $k5 * $me, 2);

print '<em>'.$me.' [т]</em>';

//-----------------------------------------Go------------------------------------------------

print '<h2>Расчет глубины зоны заражения</h2>';

$keys = array_keys($depth);

for($i = 0; $i < count($keys) - 1; $i++) {

    $m1 = $keys[$i];
    $m2 = $keys[$i+1];

    if(($me > $m1) && ($me < $m2)) break;
}

$d1 = $depth[$m1][$_POST['wind']];
$d2 = $depth[$m2][$_POST['wind']];

$Go = round($d1 + ($d2 - $d1) * ($me - $m1) / ($m2 - $m1), 2);

print 'Гобл = Г\' + (Г" - Г\') * (Mэ - M\') / (M" - M\') =
      '.$d1.' + ('.$d2.' - '.$d1.') * ('.$me.' - '.$m1.') / ('.$m2.' - '.$m1.') =
      <em>'.$Go.' [км]</em>';

print '<br/><br/>';

//-----------------------------------------Gtr-----------------------------------------------

$Gtr = $speed[$_POST['stability']][$wind] * $_POST['time'];

print 'Гпер = Vпер * Tпрог =
      '.$speed[$_POST['stability']][$wind].' * '.$_POST['time'].' =
      <em>'.$Gtr.' [км]</em>';

print '<br/><br/>';

//-----------------------------------------G-------------------------------------------------

$G = min($Go, $Gtr);

print 'Г = min(Гобл, Гпер) =
      min('.$Go.', '.$Gtr.') =
      <em>'.$G.' [км]</em>';

print '<br/><br/>';

//-----------------------------------------Tform----------------------------------------------

$Tform = round($G / $speed[$_POST['stability']][$wind], 2);

print 'Tф = Г / Vпер =
      '.$G.' / '.$speed[$_POST['stability']][$wind].' =
      <em>'.$Tform.' [ч]</em>';

//-----------------------------------------Fi-------------------------------------------------

print '<h2>Определение площади зоны заражения</h2>';

if($_POST['wind'] > 2) {

    $fi = 45;

} else if($_POST['wind'] > 1) {

    $fi = 90;

} else if($_POST['wind'] > 0.5) {

    $fi = 180;

} else {

    $fi = 360;
}

//-----------------------------------------Sp-------------------------------------------------

$Sp = round((8.73 / 1000) * $G * $G * $fi, 2);

print 'Sв = 8.73 * 10^-3 * Г^2 * Ф =
      8.73 * 10^-3 * '.$G.'^2 * '.$fi.' =
      <em>'.$Sp.' [км^2]</em>';

print '<br/><br/>';

//-----------------------------------------K8-------------------------------------------------

$k8 = k8($_POST['stability']);

//-----------------------------------------Q-------------------------------------------------

$Q = min($Tform, $_POST['time']);

print 'Q = min(Тф, Тпрог) =
      min('.$Tform.', '.$_POST['time'].') =
      <em>'.$Q.' [ч]</em>';

print '<br/><br/>';

//-----------------------------------------Sf-------------------------------------------------

$Sf = round($k8 * $G * $G * pow($Q, 0.2), 2);

print 'Sф = К8 * Г^2 * Q^0.2 =
      '.$k8.' * '.$G.'^2 * '.$Q.'^0.2 =
      <em>'.$Sf.' [км^2]</em>';

//-----------------------------------------Tcom-------------------------------------------------

if($_POST['border'] != "") {

    print '<h2>Определение времени подхода зараженного воздуха к заданной границе</h2>';

    $Tcom = round($_POST['border'] / $speed[$_POST['stability']][$wind], 2);

    print 'Tподх = Х / Vпер =
          '.$_POST['border'].' / '.$speed[$_POST['stability']][$wind].' =
          <em>'.$Tcom.' [ч]</em>';
}

?>
