<?php

require_once('../ahov.inc');

$wind = ($_POST['wind'] == "")? 1 : $_POST['wind'];

if($wind > 4) $_POST['stability'] = 'isotherm';
if($wind < 1) $wind = 1;
if($wind > 15) $wind = 15;

if(isset($_POST['max'])) { $_POST['time'] = 9999; }

$temp = ($_POST['temp'] == "")? 20 : $_POST['temp'];

$a = ahov($ahov, $_POST['ded'], $_POST['storing']);

$k1 = k1($a, $_POST['ded'], $_POST['state'], $_POST['storing']);

$k4 = k4($wind);

$k5 = k5($_POST['stability']);

$k7 = k7($a, $k1, $temp);

$h = ($_POST['height'] == "")? 0.05 : $_POST['height'] - 0.2;

//-----------------------------------------M0-------------------------------------------------

if($_POST['weight']) {

    $m0 = $_POST['weight'];

} else {

    print '<h2>Определение аварийной массы</h2>';

    if($_POST['state'] == 'liquid') {

        $m0 = round($_POST['value'] * $a['density']['liquid'] * $_POST['filling'], 2);

        print 'M0 = V * pж * Kн =
              '.$_POST['value'].' * '.$a['density']['liquid'].' * '.$_POST['filling'].' =
              <em>'.$m0.' [т]</em>';
        
    } else {

        $m0 = round($_POST['value'] * $a['density']['gas'] * $_POST['content'] * $_POST['pressure'] / 9810, 2);

        print 'M0 = V * pг * n * P =
              '.$_POST['value'].' * '.$a['density']['gas'].' * '.$_POST['content'].' * '.$_POST['pressure'].' =
              <em>'.$m0.' [т]</em>';
    }
}

if($m0 < 1) $m0 = 1;

//-----------------------------------------ME1-------------------------------------------------

$me1 = round($k1 * $a['K3'] * $k5 * $k7[1] * $m0, 2);

print '<h2>Определение эквивалентного количества вещества в первичном облаке</h2>';

print 'Mэ1 = K1 * K3 * K5 * K7п * M0 =
      '.$k1.' * '.$a['K3'].' * '.$k5.' * '.$k7[1].' * '.$m0.' = 
      <em>'.$me1.' [т]</em>';

//-----------------------------------------Tevap-----------------------------------------------

print '<h2>Определение эквивалентного количества вещества во вторичном облаке</h2>';


if($_POST['state'] == 'liquid') {

    $tevap = round($h * $a['density']['liquid'] / ($a['K2'] * $k4 * $k7[2]), 2);

    print 'Tисп = h * pж / (K2 * K4 * K7в) =
          '.$h.' * '.$a['density']['liquid'].' / ( '.$a['K2'].' * '.$k4.' * '.$k7[2].' ) =
          <em>'.$tevap.' [ч]</em>';

    print '<br/><br/>';

} else {

    print '<em>Tисп = 0 [ч]</em><br/><br/>';

}

//-----------------------------------------K6-------------------------------------------------

if($tevap < 1) {

    $k6 = 1;

} else {

    $k6 = pow(min($tevap, $_POST['time']), 0.8);

    print 'K6 = min(Tисп, Тпрог)^0.8 =
          min('.$tevap.', '.$_POST['time'].')^0.8 =
          <em>'.$k6.'</em>';

    print '<br/><br/>';
}

//-----------------------------------------ME2------------------------------------------------

$me2 = round((1 - $k1) * $a['K2'] * $a['K3'] * $k4 * $k5 * $k6 * $k7[2] * $m0 / ($h * $a['density']['liquid']), 2);

print 'Mэ2 = (1 - K1) * K2 * K3 * K4 * K5 * K6 * K7в * M0 / ( h * pж ) = 
      (1 - '.$k1.') * '.$a['K2'].' * '.$a['K3'].' * '.$k4.' * '.$k5.' * '.$k6.' * '.$k7[2].' * '.$m0.' /
      ( '.$h.' * '.$a['density']['liquid'].' ) =
      <em>'.$me2.' [т]</em>';

//-----------------------------------------G1------------------------------------------------

print '<h2>Расчет глубины зоны заражения</h2>';

$keys = array_keys($depth);

if($me1) {

    for($i = 0; $i < count($keys) - 1; $i++) {

        $m1 = $keys[$i];
        $m2 = $keys[$i+1];

        if(($me1 > $m1) && ($me1 < $m2)) break;
    }

    $d1 = $depth[$m1][$wind];
    $d2 = $depth[$m2][$wind];

    $G1 = round($d1 + ($d2 - $d1) * ($me1 - $m1) / ($m2 - $m1), 2);

    print 'Г1 = Г\' + (Г" - Г\') * (Mэ1 - M\') / (M" - M\') =
          '.$d1.' + ('.$d2.' - '.$d1.') * ('.$me1.' - '.$m1.') / ('.$m2.' - '.$m1.') =
          <em>'.$G1.' [км]</em>';

    print '<br/><br/>';

} else {

    $G1 = 0;

    print '<em>Г1 = 0 [км]</em>';

    print '<br/><br/>';
}

//-----------------------------------------G2------------------------------------------------

if($me2) {

    for($i = 0; $i < count($keys) - 1; $i++) {

        $m1 = $keys[$i];
        $m2 = $keys[$i+1];

        if(($me2 > $m1) && ($me2 < $m2)) break;
    }

    $d1 = $depth[$m1][$wind];
    $d2 = $depth[$m2][$wind];

    $G2 = round($d1 + ($d2 - $d1) * ($me2 - $m1) / ($m2 - $m1), 2);

    print 'Г2 = Г\' + (Г" - Г\') * (Mэ2 - M\') / (M" - M\') =
          '.$d1.' + ('.$d2.' - '.$d1.') * ('.$me2.' - '.$m1.') / ('.$m2.' - '.$m1.') =
          <em>'.$G2.' [км]</em>';

    print '<br/><br/>';

} else {

    $G2 = 0;

    print '<em>Г2 = 0 [км]</em>';

    print '<br/><br/>';
}

//-----------------------------------------Go------------------------------------------------

$Go = max($G1, $G2) + 0.5 * min($G1, $G2);

print 'Гоб = max(Г1, Г2) + 0.5 * min(Г1, Г2) =
      max('.$G1.', '.$G2.') + 0.5 * min('.$G1.', '.$G2.') =
      <em>'.$Go.' [км]</em>';

print '<br/><br/>';

//-----------------------------------------Gtr-----------------------------------------------

$Gtr = $speed[$_POST['stability']][$wind] * $_POST['time'];

print 'Гпер = Vпер * Tпрог =
      '.$speed[$_POST['stability']][$wind].' * '.$_POST['time'].' =
      <em>'.$Gtr.' [км]</em>';

print '<br/><br/>';

//-----------------------------------------G-------------------------------------------------

$G = min($Go, $Gtr);

print 'Г = min(Гобл, Гпер) =
      min('.$Go.', '.$Gtr.') =
      <em>'.$G.' [км]</em>';

print '<br/><br/>';

//-----------------------------------------Tform----------------------------------------------

$Tform = round($G / $speed[$_POST['stability']][$wind], 2);

print 'Tф = Г / Vпер =
      '.$G.' / '.$speed[$_POST['stability']][$wind].' =
      <em>'.$Tform.' [ч]</em>';

//-----------------------------------------Fi-------------------------------------------------

print '<h2>Определение площади зоны заражения</h2>';

if($_POST['wind'] > 2) {

    $fi = 45;

} else if($_POST['wind'] > 1) {

    $fi = 90;

} else if($_POST['wind'] > 0.5) {

    $fi = 180;

} else {

    $fi = 360;
}

//-----------------------------------------Sp-------------------------------------------------

$Sp = round((8.73 / 1000) * $G * $G * $fi, 2);

print 'Sв = 8.73 * 10^-3 * Г^2 * Ф =
      8.73 * 10^-3 * '.$G.'^2 * '.$fi.' =
      <em>'.$Sp.' [км^2]</em>';

print '<br/><br/>';

//-----------------------------------------K8-------------------------------------------------

$k8 = k8($_POST['stability']);

//-----------------------------------------Q-------------------------------------------------

$Q = min($Tform, $_POST['time']);

print 'Q = min(Тф, Тпрог) =
      min('.$Tform.', '.$_POST['time'].') =
      <em>'.$Q.' [ч]</em>';

print '<br/><br/>';

//-----------------------------------------Sf-------------------------------------------------

$Sf = round($k8 * $G * $G * pow($Q, 0.2), 2);

print 'Sф = К8 * Г^2 * Q^0.2 =
      '.$k8.' * '.$G.'^2 * '.$Q.'^0.2 =
      <em>'.$Sf.' [км^2]</em>';

//-----------------------------------------Tcom-------------------------------------------------

if($_POST['border'] != "") {

    print '<h2>Определение времени подхода зараженного воздуха к заданной границе</h2>';

    $Tcom = round($_POST['border'] / $speed[$_POST['stability']][$wind], 2);

    print 'Tподх = Х / Vпер =
          '.$_POST['border'].' / '.$speed[$_POST['stability']][$wind].' =
          <em>'.$Tcom.' [ч]</em>';
}

?>
